RT-Thread/rt-thread/bsp/freescale/platform/system/src/clock/MKM34Z7/fsl_clock_MKM34Z7.c
    switch (lptmrSrc)
    {
        case kClockLptmrSrcMcgIrClk:                      /* MCGIRCLK  clock */
            freq = CLOCK_HAL_GetInternalRefClk(MCG);
            break;
        case kClockLptmrSrcLpoClk:                        /* LPO       clock */
            freq = CLOCK_SYS_GetLpoClockFreq();
            break;
        case kClockLptmrSrcEr32kClk:                     /* ERCLK32K clock */
            freq = CLOCK_SYS_GetExternalRefClock32kFreq();
            break;
        case kClockLptmrSrcOsc0erClk:                     /* OSCERCLK  clock */
            freq = CLOCK_SYS_GetOsc0ExternalRefClockFreq();
            break;
        default:
            freq = 0U;
            break;
    }

    return freq;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetSLcdFreq
 * Description   : Gets the Segment LCD clock frequency.
 * This function gets the Segment LCD clock frequency.
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetSlcdFreq(uint32_t instance, clock_slcd_src_t slcdSrc)
{
    uint32_t freq;

    switch (slcdSrc)
    {
        case kClockSLcdSrcMcgIrClk:                      /* MCGIRCLK  clock */
            freq = CLOCK_HAL_GetInternalRefClk(MCG);
            break;
        case kClockSLcdSrcOsc32kClk:                     /* ERCLK32K clock */
            freq = CLOCK_SYS_GetExternalRefClock32kFreq();
            break;
        default:
            freq = 0U;
            break;
    }
    return freq;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetUartFreq
 * Description   : Gets the clock frequency for UART module.
 * This function gets the clock frequency for UART module.
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetUartFreq(uint32_t instance)
{
    uint32_t freq = 0;

    switch (instance)
    {
    case 0:
    case 2:
        freq = CLOCK_SYS_GetBusClockFreq();
        break;
    case 1:
    case 3:
        freq = CLOCK_SYS_GetSystemClockFreq();
        break;
    default:
	    freq = 0U;
        break;
    }

    return freq;
}

/* PORT instance table. */
static const sim_clock_gate_name_t portGateTable[] =
{
    kSimClockGatePortA,
    kSimClockGatePortB,
    kSimClockGatePortC,
    kSimClockGatePortD,
    kSimClockGatePortE,
    kSimClockGatePortF,
    kSimClockGatePortG,
    kSimClockGatePortH,
    kSimClockGatePortI,
    kSimClockGatePortJ,
    kSimClockGatePortK,
    kSimClockGatePortL,
    kSimClockGatePortM
};

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_EnablePortClock
 * Description   : Enable the clock for PORT module
 * This function enables the clock for PORT module
 *
 *END**************************************************************************/
void CLOCK_SYS_EnablePortClock(uint32_t instance)
{
    assert(instance < sizeof(portGateTable)/sizeof(portGateTable[0]));

    SIM_HAL_EnableClock(SIM, portGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_DisablePortClock
 * Description   : Disable the clock for PORT module
 * This function disables the clock for PORT module
 *
 *END**************************************************************************/
void CLOCK_SYS_DisablePortClock(uint32_t instance)
{
    assert(instance < sizeof(portGateTable)/sizeof(portGateTable[0]));

    SIM_HAL_DisableClock(SIM, portGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetPortGateCmd
 * Description   : Get the the clock gate state for PORT module
 * This function will get the clock gate state for PORT module.
 *
 *END**************************************************************************/
bool CLOCK_SYS_GetPortGateCmd(uint32_t instance)
{
    assert(instance < sizeof(portGateTable)/sizeof(portGateTable[0]));

    return SIM_HAL_GetGateCmd(SIM, portGateTable[instance]);
}

/* ADC instance table. */
static const sim_clock_gate_name_t adcGateTable[] =
{
    kSimClockGateAdc0
};

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_EnableAdcClock
 * Description   : Enable the clock for ADC module
 * This function enables the clock for ADC module
 *
 *END**************************************************************************/
void CLOCK_SYS_EnableAdcClock(uint32_t instance)
{
    assert(instance < sizeof(adcGateTable)/sizeof(adcGateTable[0]));

    SIM_HAL_EnableClock(SIM, adcGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_DisableAdcClock
 * Description   : Disable the clock for ADC module
 * This function disables the clock for ADC module
 *
 *END**************************************************************************/
void CLOCK_SYS_DisableAdcClock(uint32_t instance)
{
    assert(instance < sizeof(adcGateTable)/sizeof(adcGateTable[0]));

    SIM_HAL_DisableClock(SIM, adcGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetAdcGateCmd
 * Description   : Get the the clock gate state for ADC module
 * This function will get the clock gate state for ADC module.
 *
 *END**************************************************************************/
bool CLOCK_SYS_GetAdcGateCmd(uint32_t instance)
{
    assert(instance < sizeof(adcGateTable)/sizeof(adcGateTable[0]));

    return SIM_HAL_GetGateCmd(SIM, adcGateTable[instance]);
}

/* PIT instance table. */
static const sim_clock_gate_name_t pitGateTable[] =
{
    kSimClockGatePit0,
    kSimClockGatePit1
};

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_EnablePitClock
 * Description   : Enable the clock for PIT module
 * This function enables the clock for PIT module
 *
 *END**************************************************************************/
void CLOCK_SYS_EnablePitClock(uint32_t instance)
{
    assert(instance < sizeof(pitGateTable)/sizeof(pitGateTable[0]));

    SIM_HAL_EnableClock(SIM, pitGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_DisablePitClock
 * Description   : Disable the clock for PIT module
 * This function disables the clock for PIT module
 *
 *END**************************************************************************/
void CLOCK_SYS_DisablePitClock(uint32_t instance)
{
    assert(instance < sizeof(pitGateTable)/sizeof(pitGateTable[0]));

    SIM_HAL_DisableClock(SIM, pitGateTable[instance]);
}


/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetPitGateCmd
 * Description   : Get the the clock gate state for PIT module
 * This function will get the clock gate state for PIT module.
 *
 *END**************************************************************************/
bool CLOCK_SYS_GetPitGateCmd(uint32_t instance)
{
    assert(instance < sizeof(pitGateTable)/sizeof(pitGateTable[0]));

    return SIM_HAL_GetGateCmd(SIM, pitGateTable[instance]);
}

